derskop/zephyr/include/zephyr/dt-bindings/reset/n32g45x-reset.h
/*
 * Copyright (c) 2026 Nations Technologies
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief Peripheral reset identifiers for Nations N32G45x
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_RESET_N32G45X_RESET_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_RESET_N32G45X_RESET_H_

/* RCC peripheral reset register offsets. */
#define N32_APB2PRST_OFFSET 0x0CU
#define N32_APB1PRST_OFFSET 0x10U
#define N32_AHBPRST_OFFSET  0x28U

/* Encode an RCC reset register offset and reset bit in one reset cell. */
#define N32_RESET_CONFIG(reg, bit) (((N32_ ## reg ## _OFFSET) << 6U) | (bit))

/* APB2 peripherals. */
#define N32_RESET_AFIO   N32_RESET_CONFIG(APB2PRST, 0U)
#define N32_RESET_GPIOA  N32_RESET_CONFIG(APB2PRST, 2U)
#define N32_RESET_GPIOB  N32_RESET_CONFIG(APB2PRST, 3U)
#define N32_RESET_GPIOC  N32_RESET_CONFIG(APB2PRST, 4U)
#define N32_RESET_GPIOD  N32_RESET_CONFIG(APB2PRST, 5U)
#define N32_RESET_GPIOE  N32_RESET_CONFIG(APB2PRST, 6U)
#define N32_RESET_GPIOF  N32_RESET_CONFIG(APB2PRST, 7U)
#define N32_RESET_GPIOG  N32_RESET_CONFIG(APB2PRST, 8U)
#define N32_RESET_TIM1   N32_RESET_CONFIG(APB2PRST, 11U)
#define N32_RESET_SPI1   N32_RESET_CONFIG(APB2PRST, 12U)
#define N32_RESET_TIM8   N32_RESET_CONFIG(APB2PRST, 13U)
#define N32_RESET_USART1 N32_RESET_CONFIG(APB2PRST, 14U)
#define N32_RESET_DVP    N32_RESET_CONFIG(APB2PRST, 16U)
#define N32_RESET_UART6  N32_RESET_CONFIG(APB2PRST, 17U)
#define N32_RESET_UART7  N32_RESET_CONFIG(APB2PRST, 18U)
#define N32_RESET_I2C3   N32_RESET_CONFIG(APB2PRST, 19U)
#define N32_RESET_I2C4   N32_RESET_CONFIG(APB2PRST, 20U)

/* APB1 peripherals. */
#define N32_RESET_TIM2   N32_RESET_CONFIG(APB1PRST, 0U)
#define N32_RESET_TIM3   N32_RESET_CONFIG(APB1PRST, 1U)
#define N32_RESET_TIM4   N32_RESET_CONFIG(APB1PRST, 2U)
#define N32_RESET_TIM5   N32_RESET_CONFIG(APB1PRST, 3U)
#define N32_RESET_TIM6   N32_RESET_CONFIG(APB1PRST, 4U)
#define N32_RESET_TIM7   N32_RESET_CONFIG(APB1PRST, 5U)
#define N32_RESET_TSC    N32_RESET_CONFIG(APB1PRST, 10U)
#define N32_RESET_WWDG   N32_RESET_CONFIG(APB1PRST, 11U)
#define N32_RESET_SPI2   N32_RESET_CONFIG(APB1PRST, 14U)
#define N32_RESET_SPI3   N32_RESET_CONFIG(APB1PRST, 15U)
#define N32_RESET_USART2 N32_RESET_CONFIG(APB1PRST, 17U)
#define N32_RESET_USART3 N32_RESET_CONFIG(APB1PRST, 18U)
#define N32_RESET_UART4  N32_RESET_CONFIG(APB1PRST, 19U)
#define N32_RESET_UART5  N32_RESET_CONFIG(APB1PRST, 20U)
#define N32_RESET_I2C1   N32_RESET_CONFIG(APB1PRST, 21U)
#define N32_RESET_I2C2   N32_RESET_CONFIG(APB1PRST, 22U)
#define N32_RESET_USB    N32_RESET_CONFIG(APB1PRST, 23U)
#define N32_RESET_CAN1   N32_RESET_CONFIG(APB1PRST, 25U)
#define N32_RESET_CAN2   N32_RESET_CONFIG(APB1PRST, 26U)
#define N32_RESET_BKP    N32_RESET_CONFIG(APB1PRST, 27U)
#define N32_RESET_PWR    N32_RESET_CONFIG(APB1PRST, 28U)
#define N32_RESET_DAC    N32_RESET_CONFIG(APB1PRST, 29U)

/* AHB peripherals. */
#define N32_RESET_RNGC   N32_RESET_CONFIG(AHBPRST, 9U)
#define N32_RESET_SAC    N32_RESET_CONFIG(AHBPRST, 11U)
#define N32_RESET_ADC1   N32_RESET_CONFIG(AHBPRST, 12U)
#define N32_RESET_ADC2   N32_RESET_CONFIG(AHBPRST, 13U)
#define N32_RESET_ADC3   N32_RESET_CONFIG(AHBPRST, 14U)
#define N32_RESET_ADC4   N32_RESET_CONFIG(AHBPRST, 15U)
#define N32_RESET_ETHMAC N32_RESET_CONFIG(AHBPRST, 16U)
#define N32_RESET_QSPI   N32_RESET_CONFIG(AHBPRST, 17U)

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_RESET_N32G45X_RESET_H_ */
